# RbsNetworkValidityError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..RbsNetworkValidityError Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The family is connected in a network and can no longer keep the connectivity.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RbsNetworkValidityError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsNetworkValidityError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RbsNetworkValidityError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace